[
  {
    "title": "The Dolphins’ Offense Can Break the Dam (If They Fix These Two Leaks)",
    "subtitle": "Personnel is elite; sequencing and situational calls aren’t. Two fixes.",
    "date": "2025-10-27",
    "tags": [
      "Dolphins",
      "NFL"
    ],
    "slug": "dolphins-offense-two-fixes",
    "body": "# TL;DR\nMiami is *this* close. The talent is unquestioned. The issues are sequencing on early downs and fourth-down decision-making when EPA says go.\n\n## Leak #1: Early-down predictability\nToo much outside zone on 1st & 10 from neutral scripts. Mix in motion-to-bunch and RPO glance on 1st down to punish static light boxes.\n\n## Leak #2: Fourth-down conservatism\nInside the opponent 45, 4th-and-<3 with a healthy offense should be automatic. Stretch the field horizontally to create a yak throw.\n\n- Script 1: Tyreek jet orbit to move the apex; run split-zone insert back the other way.\n- Script 2: Fast-4 strong; return to leak flat. Free yards.\n\n```\n“You don’t fix identity—just the timings that reveal it.”\n```\n\n## What I want to see next week\n- +10% RPO rate on 1st down\n- Reduce outside zone rate by 8–12% in neutral scripts\n- Leverage motion to force static coverage tells early"
  },
  {
    "title": "Wizards Rant: Stop Pretending ‘Rebuild’ Means Vibes",
    "subtitle": "Draft capital without a player-development spine is just hoarding.",
    "date": "2025-10-27",
    "tags": [
      "Wizards",
      "NBA"
    ],
    "slug": "wizards-rebuild-requires-spine",
    "body": "# TL;DR\nAsset accumulation ≠ development. The Wizards need a coherent player archetype, two pet actions, and a defensive baseline.\n\n## Archetype\nLong, fast, multi-positional wings with real handle. Draft for two-way upside, not just tools.\n\n## Pet actions\n- Horns Twist into empty-corner PnR for your lead handler.\n- Chicago into Spain, but emphasize the *slip* to punish switches.\n\n## Baseline defense\nDrop with weak-side low man pre-loaded. You can’t switch everything without switchable talent.\n\n## KPI to track\n- Advantage creation rate per halfcourt possession\n- Shot quality delta vs opponent (location eFG)\n- Player dev minutes in two-man actions (not garbage time)"
  }
]