[
  {
    "title": "The Dolphins’ Offense Can Break the Dam (If They Fix These Two Leaks)",
    "subtitle": "Personnel is elite; sequencing and situational calls aren’t. Two fixes.",
    "date": "2025-10-27",
    "tags": [
      "Dolphins",
      "NFL"
    ],
    "slug": "dolphins-offense-two-fixes",
    "body": "# TL;DR\nMiami is *this* close. The talent is unquestioned. The issues are sequencing on early downs and fourth-down decision-making when EPA says go.\n\n## Leak #1: Early-down predictability\nToo much outside zone on 1st & 10 from neutral scripts. Mix in motion-to-bunch and RPO glance on 1st down to punish static light boxes.\n\n## Leak #2: Fourth-down conservatism\nInside the opponent 45, 4th-and-<3 with a healthy offense should be automatic. Stretch the field horizontally to create a yak throw."
  },
  {
    "title": "Wizards Rant: Stop Pretending ‘Rebuild’ Means Vibes",
    "subtitle": "Draft capital without a player-development spine is just hoarding.",
    "date": "2025-10-27",
    "tags": [
      "Wizards",
      "NBA"
    ],
    "slug": "wizards-rebuild-requires-spine",
    "body": "# TL;DR\nAsset accumulation ≠ development. The Wizards need a coherent player archetype, two pet actions, and a defensive baseline.\n\n## Archetype\nLong, fast, multi-positional wings with real handle. Draft for two-way upside, not just tools.\n\n## Pet actions\n- Horns Twist into empty-corner PnR for your lead handler."
  },
  {
  "title": "Offensive Line Surprises in Dolphins Road Victory",
  "subtitle": "The Miami Dolphins play complementary football in win at Falcons",
  "date": "2025-10-27",
  "tags": ["Dolphins"],
  "slug": "offensive-line-surprises-in-win",
  "body": "\nThose first two 'blogs' weren't me; they were AI. \nThe Phins' performance on Sunday felt like betrayal. After seven consecutive weeks of dysfuncional uninspiring football, the team comes out and puts together their best performance of the season in a 34-10 win in Atlanta. \nDid having Cousins at QB instead of Penix change the outcome of the game? Of course. But that doesn't change the fact that the Phins D-line held Bijan Robinson to 25 yards on nine carries. Standouts included Brooks, Melifonwu, Fitzpatrick, and Douglas among some others. \nMike McDaniel put together an offensive masterclass on Sunday. By establishing and sticking with the run, everything opened up. Ollie Gordon II had (what I would call) his second star outing with 66 yards from scrimmage. If he can keep complementing Achane and adding power to the backfield, we should be running the ball at least 30 times per game. What's crazy (but maybe intuitive) is that the Phins' victory on Sunday marked their first game this season where they ran (33) more than they passed (24)."
}
]
